In [5]:
import pandas as pd     

staff_df = pd.DataFrame([{'Name': 'Kelly','Role':'Director of HR'},
                         {'Name': 'Sally','Role':'Course Liason'},
                         {'Name': 'James','Role':'Grader'}])

staff_df = staff_df.set_index('Name')

student_df = pd.DataFrame([{'Name': 'James','School':'Business'},
                           {'Name': 'Mike','School':'Law'},
                           {'Name': 'Sally','School':'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df)
print(student_df)

                 Role
Name
Kelly  Director of HR
Sally   Course Liason
James          Grader
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [6]:
pd.merge(staff_df, student_df, how='outer',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally   Course Liason  Engineering

In [7]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

                Role       School
Name
Sally  Course Liason  Engineering
James         Grader     Business

In [8]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally   Course Liason  Engineering
James          Grader     Business

In [9]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

                Role       School
Name
James         Grader     Business
Mike             NaN          Law
Sally  Course Liason  Engineering

In [10]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()

pd.merge(staff_df,student_df, how='right', on='Name')

    Name           Role       School
0  James         Grader     Business
1   Mike            NaN          Law
2  Sally  Course Liason  Engineering

In [13]:
staff_df = pd.DataFrame([{'Name': 'Kelly','Role':'Director of HR',
                          'Location': 'State Street'},
                         {'Name': 'Sally','Role':'Course Liason',
                          'Location': 'Washington Avenue'},
                         {'Name': 'James','Role':'Grader',
                          'Location':'Washington Avenue'}])



student_df = pd.DataFrame([{'Name': 'James','School':'Business',
                            'Location':'1024 Billiard Avenue'},
                           {'Name': 'Mike','School':'Law',
                            'Location':'Fraternity House #22'},
                           {'Name': 'Sally','School':'Engineering',
                            'Location':'512 Wilson Crescent'}])

pd.merge(staff_df,student_df, how='left', on='Name')

    Name            Role         Location_x       School            Location_y
0  Kelly  Director of HR       State Street          NaN                   NaN
1  Sally   Course Liason  Washington Avenue  Engineering   512 Wilson Crescent
2  James          Grader  Washington Avenue     Business  1024 Billiard Avenue

In [18]:
staff_df = pd.DataFrame([{'First Name': 'Kelly','Last Name': 'Desjardins','Role':'Director of HR',
                          'Location': 'State Street'},
                         {'First Name': 'Sally','Last Name': 'Brooks','Role':'Course Liason',
                          'Location': 'Washington Avenue'},
                         {'First Name': 'James','Last Name': 'Wilde','Role':'Grader',
                          'Location':'Washington Avenue'}])



student_df = pd.DataFrame([{'First Name': 'James','Last Name': 'Hammond','School':'Business',
                            'Location':'1024 Billiard Avenue'},
                           {'First Name': 'Mike','Last Name': 'Smith','School':'Law',
                            'Location':'Fraternity House #22'},
                           {'First Name': 'Sally','Last Name': 'Brooks','School':'Engineering',
                            'Location':'512 Wilson Crescent'}])

pd_merge = pd.merge(staff_df,student_df, how='inner',on=['First Name','Last Name'])

pd_merge.head(10)

,First Name,Last Name,Role,Location_x,School,Location_y
0,Sally,Brooks,Course Liason,Washington Avenue,Engineering,512 Wilson Crescent

In [24]:
%%capture

df_2004 = pd.read_csv('MERGED2004_05_PP.csv')
df_2005 = pd.read_csv('MERGED2005_06_PP.csv')
df_2006 = pd.read_csv('MERGED2006_07_PP.csv')

In [25]:
df_2004.head(3)

,UNITID,OPEID,OPEID6,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,NPCURL,...,OMAWDP8_NOTFIRSTTIME_POOLED_SUPP,OMENRUP_NOTFIRSTTIME_POOLED_SUPP,OMENRYP_FULLTIME_POOLED_SUPP,OMENRAP_FULLTIME_POOLED_SUPP,OMAWDP8_FULLTIME_POOLED_SUPP,OMENRUP_FULLTIME_POOLED_SUPP,OMENRYP_PARTTIME_POOLED_SUPP,OMENRAP_PARTTIME_POOLED_SUPP,OMAWDP8_PARTTIME_POOLED_SUPP,OMENRUP_PARTTIME_POOLED_SUPP
0,100654,00100200,1002,Alabama A & M University,Normal,AL,35762,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,100663,00105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,100690,02503400,25034,Amridge University,Montgomery,AL,36117-3553,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [26]:
print(len(df_2004))
print(len(df_2005))
print(len(df_2006))

6660
6824
6848

In [27]:
frames = [df_2004,df_2005,df_2006]
pd.concat(frames)

,UNITID,OPEID,OPEID6,INSTNM,CITY,STABBR,ZIP,ACCREDAGENCY,INSTURL,NPCURL,...,OMAWDP8_NOTFIRSTTIME_POOLED_SUPP,OMENRUP_NOTFIRSTTIME_POOLED_SUPP,OMENRYP_FULLTIME_POOLED_SUPP,OMENRAP_FULLTIME_POOLED_SUPP,OMAWDP8_FULLTIME_POOLED_SUPP,OMENRUP_FULLTIME_POOLED_SUPP,OMENRYP_PARTTIME_POOLED_SUPP,OMENRAP_PARTTIME_POOLED_SUPP,OMAWDP8_PARTTIME_POOLED_SUPP,OMENRUP_PARTTIME_POOLED_SUPP
0,100654,00100200,1002,Alabama A & M University,Normal,AL,35762,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,100663,00105200,1052,University of Alabama at Birmingham,Birmingham,AL,35294-0110,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,100690,02503400,25034,Amridge University,Montgomery,AL,36117-3553,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,100706,00105500,1055,University of Alabama in Huntsville,Huntsville,AL,35899,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,100724,00100500,1005,Alabama State University,Montgomery,AL,36104-0271,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6843,44098901,02568108,25681,Texas Barber College - Branch Campus #1,Dallas,TX,75241,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6844,44098902,02568101,25681,Texas Barber College - Branch Campus #2,Dallas,TX,75228,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6845,44098903,02568106,25681,Texas Barber Colleges and Hairstyling Schools ...,Houston,TX,77063,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6846,44098904,02568107,25681,Texas Barber College - Branch Campus #5,Houston,TX,77022,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6847,44098905,02568109,25681,Texas Barber Colleges and Hairstyling Schools ...,Conroe,TX,77301,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN